{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 15], "input_dtype": "int32", "input_dim": 19367, "output_dim": 256, "init": "uniform", "input_length": 15, "mask_zero": false, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "dropout": 0.0}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "forward_lstm_1", "trainable": true, "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 256, "input_length": null, "output_dim": 128, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "forward_lstm_2", "trainable": true, "return_sequences": false, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 256, "input_length": null, "output_dim": 64, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.9}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 32, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 128}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "output_dim": 16, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 32}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.6}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "output_dim": 8, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 16}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "output_dim": 3, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 8}}], "keras_version": "1.2.0"}